common/xrd-automated-tests/mock/queries/centralservice.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xrd="http://x-road.eu/xsd/xroad.xsd"
xmlns:id="http://x-road.eu/xsd/identifiers"
xmlns:ns1="http://producer.x-road.eu">
   <soapenv:Header>
      <xrd:protocolVersion>{xroadProtocolVersion}</xrd:protocolVersion>
      <xrd:issue>{xroadIssue}</xrd:issue>
      <xrd:userId>{xroadUserId}</xrd:userId>
      <xrd:id>{uuid}</xrd:id>
      <xrd:centralService id:objectType="CENTRALSERVICE">
         <id:xRoadInstance>{serviceMemberInstance}</id:xRoadInstance>
         <id:serviceCode>{serviceMemberCode}</id:serviceCode>
      </xrd:centralService>
      <xrd:client id:objectType="MEMBER">
         <id:xRoadInstance>{memberInstance}</id:xRoadInstance>
         <id:memberClass>{memberClass}</id:memberClass>
         <id:memberCode>{memberCode}</id:memberCode>
         <!--Optional:-->
         <id:subsystemCode>{subsystemCode}</id:subsystemCode>
      </xrd:client>
   </soapenv:Header>
   <soapenv:Body>
      <ns1:xroadGetRandom>
         <request>
            <seed>100</seed>
         </request>
      </ns1:xroadGetRandom>
   </soapenv:Body>
</soapenv:Envelope>
